cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'

brew 'ack'
brew 'cocoapods'
brew 'coreutils'
brew 'gh'
brew 'go'
brew 'grc'
brew 'guetzli'
brew 'hugo'
brew 'influxdb'
brew 'influxdb-cli'
brew 'jq'
brew 'openssl'
brew 'mas'
brew 'node'
brew 'npm'
brew 'postgresql'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'sonos'
brew 'unar'
brew 'vips'
brew 'wget'
brew 'yarn'
brew 'yt-dlp'

cask '1password'
cask 'asana'
cask 'docker'
cask 'dropbox'
cask 'github'
cask 'google-chrome'
cask 'launchcontrol'
cask 'notion'
cask 'pastebot'
cask 'paw'
cask 'sketch'
# cask 'slack' - this now installed from Mac App Store
# cask 'sonos'
cask 'vlc'
cask 'visual-studio-code'
cask 'zoom'

mas "1Blocker", id: 1365531024
mas "Postico", id: 1031280567
mas "DaisyDisk", id: 411643860
mas "XCode", id: 497799835
mas "Slack for Desktop", id: 803453959
mas "Bumpr", id: 1166066070