cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'zero-sh/tap'

brew 'ack'
brew 'apply-user-defaults' #see: github.com/zero-sh/apply-user-defaults
brew 'cocoapods'
brew 'coreutils'
brew 'gh'
brew 'go'
brew 'grc'
brew 'guetzli'
brew 'hugo'
brew 'influxdb'
brew 'influxdb-cli'
brew 'jq'
brew 'openssl'
brew 'mas'
brew 'node'
brew 'npm'
brew 'pandoc'
brew 'postgresql@17'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'telnet'
brew 'tmux'
brew 'unar'
brew 'vips'
brew 'wget'
brew 'yarn'
brew 'yt-dlp'

cask '1password'
cask 'asana'
cask 'audacity'
# cask 'calibre'
cask 'canva'
cask 'chronosync'
cask 'claude'
# cask 'docker'  # Removed - not used in production
cask 'dropbox'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'launchcontrol'
cask 'macwhisper'
cask 'microsoft-teams'
cask 'notion'
cask 'pastebot'
cask 'rapidapi'
cask 'sf-symbols'
cask 'sketch'
# cask 'slack' # Removed - now installed from Mac App Store
cask 'sonos'
cask 'tailscale'
cask 'trader-workstation'
cask 'vlc'
cask 'visual-studio-code'
cask 'zoom'

mas "1Blocker", id: 1365531024
mas "Amphetamine", id: 937984704
mas "Instapaper", id: 288545208
mas "Mp3tag", id: 1532597159
mas "Pixelmator Pro", id: 1289583905
mas "Postico", id: 1031280567
mas "DaisyDisk", id: 411643860
mas "XCode", id: 497799835
mas "Slack for Desktop", id: 803453959
mas "Bumpr", id: 1166066070
